package Sem_02;

public class Task_05 {
//     Напишите метод, который вернет содержимое текущей папки в виде массива строк. ArrayList и рекурсией по всем подкаталогам
// Напишите метод, который выведет массив, возвращенный предыдущим методом в файл.
// Обработайте ошибки с помощью try-catch конструкции. В случае возникновения исключения, оно должно записаться в лог-файл.
// https://metanit.com/java/tutorial/6.11.php
// [ “Sem1”, “Sem2”]

    public static void main(String[] args) {
        
    }
}
